the
of
return
given
a
and
is
in
an
that
are
to
you
if
array
integer
number
where
be
can
it
all
each
n
for
with
1
two
from
any
or
there
one
0
at
not
by
string
as
such
integers
have
order
length
on
example
following
-
same
nums
x
has
this
i
no
will
0-indexed
only
may
maximum
note
minimum
ith
answer
2
after
value
k
sum
than
possible
some
equal
s
which
elements
between
then
its
also
first
should
true
must
every
more
we
binary
otherwise
positive
characters
find
so
left
strings
-1
represents
right
exactly
into
other
3
m
false
them
both
values
list
element
times
size
2d
row
ie
most
contains
int
your
empty
time
they
different
nodes
index
least
make
j
tree
b
valid
their
representing
when
numbers
choose
column
result
sequence
either
exists
letters
write
node
7
multiple
words
character
matrix
arrays
operation
move
type
consisting
distinct
query
unique
does
do
smallest
once
another
cannot
grid
total
non-empty
format
sorted
represented
key
root
want
within
indices
position
consists
since
initially
three
name
109
indicates
adjacent
large
modulo
without
arr
less
class
contiguous
operations
digits
using
considered
numsi
implement
returns
table
range
defined
but
path
c
starting
these
last
contain
4
start
new
largest
greater
5
lowercase
target
set
primary
need
before
remaining
denotes
sql
schema
end
substring
second
cell
inclusive
subarray
next
take
initializes
object
numbered
containing
form
above
means
even
word
up
y
original
guaranteed
generated
pair
edges
function
letter
called
consecutive
remove
difference
get
single
rules
edge
respectively
allowed
longest
english
until
id
cells
connected
test
strictly
moves
score
change
use
conditions
starts
labeled
input
product
reach
four
assume
add
non-negative
distance
group
very
digit
answers
point
design
always
cases
deleting
subsequence
because
pairs
however
needed
could
exist
was
while
step
points
follows
current
down
top
1s
amount
positions
ai
case
rows
notice
varchar
perform
changing
steps
graph
day
game
many
void
formed
bi
leading
way
formally
appear
answeri
edgesi
used
space
ends
who
replace
would
d
numsj
t
nums1
whose
person
present
zero
queries
10
resulting
substrings
9
becomes
represent
6
returned
ways
takes
smaller
square
undirected
r
0s
increasing
absolute
pick
appears
final
through
zeros
line
ascending
output
possibly
xi
lexicographically
turn
jth
task
how
about
been
delete
including
nums2
part
place
count
common
alice
swap
non-decreasing
moving
algorithm
previous
among
required
below
information
chosen
like
still
data
subarrays
direction
split
corresponding
odd
report
numslength
num
complete
itself
cost
solution
good
yi
null
price
linked
representation
structure
search
consider
performing
impossible
arri
call
out
made
removing
accepted
let
----------------------
determine
directly
head
initial
separated
8
types
according
process
too
groups
height
ordered
people
applying
city
divide
z
kth
highest
shortest
go
val
color
32-bit
divisible
along
permutation
bottom
actual
abc
reverse
l
p
prefix
bob
optimally
become
occurs
already
coordinates
removed
goal
spaces
average
palindrome
alphabet
whether
written
boolean
derived
infinite
date
none
were
placed
decimal
obtain
queriesi
days
1-indexed
lower
player
turns
entire
code
except
define
outside
trees
convert
wants
occurrence
pass
shown
play
children
area
being
occurrences
ab
problem
over
added
board
during
apply
concatenation
paths
corner
never
negative
beginning
special
plane
currently
subsequences
duplicate
players
equals
ones
together
subtree
obtained
lowest
long
satisfies
back
instead
select
visited
connecting
ans
those
money
simultaneously
system
keys
calls
uppercase
bitwise
duplicates
minutes
water
subset
employee
e
10-5
bottom-right
directions
insert
parent
level
sort
parentheses
tie
solve
playing
know
lengths
visit
o
frequency
u
forward
100
check
receive
third
top-left
correct
constraints
see
necessarily
customer
results
seconds
child
unit
columns
si
repeat
said
fit
travel
taken
under
names
invalid
denoting
arranged
ansi
interval
user
------------------------
upper
create
changed
east
text
mat
concatenated
just
twice
width
needs
he
located
vertical
fewer
stones
mentioned
greatest
leaf
choosing
rectangle
adding
satisfy
full
relative
build
maximize
several
squares
vi
ui
functions
s1
s2
ids
side
map
per
please
built-in
road
item
11
based
bst
described
signed
power
complexity
arr1
continue
bits
places
partition
gets
done
flip
put
assigned
employees
location
larger
leftmost
rounded
meaning
n-1
rotate
denote
student
students
items
prices
wordsi
passed
filled
front
increase
weight
land
divided
numsk
achieve
coordinate
closest
followed
colors
xor
bit
rearrange
consist
wall
backward
nums0
certain
standing
nth
expression
include
divisor
prime
palindromic
suppose
method
traversal
construct
adds
scores
destination
units
lists
x-axis
west
arrj
col
follow
starti
endi
his
extra
deleted
vertices
inside
vertically
addition
horizontal
moment
calculated
calculate
replacing
replaced
robot
subtract
cities
assuming
wins
stop
pattern
middle
stops
repeated
concatenating
trailing
well
limit
stone
circular
modify
costs
run
increment
clockwise
south
north
arrlength
arr0
properties
4-directionally
floor
maximized
diagonal
events
occur
box
again
foreign
-----------------------
reads
nums1i
similarly
going
fn
non-overlapping
assign
differ
w
our
examples
state
-------------------
buy
finish
network
friends
found
instance
customers
2n
room
seats
exceed
company
transform
event
describes
inputs
version
played
cover
removes
directed
rest
condition
append
reaches
round
ri
v
salary
rooted
onto
longer
plus
shows
having
merge
horizontally
share
belong
1st
word1
word2
bidirectional
pile
pay
due
modified
13
minimize
stack
seat
pointsi
circle
belongs
blue
red
1000
inserted
store
program
continuous
solutions
much
rotation
leave
fits
x1
had
available
specific
walk
nearest
now
sentence
rightmost
accepts
meets
depth
might
minute
off
additional
random
keep
building
products
division
indicating
created
high
meet
f
piles
zeroes
reversed
h
request
friend
piece
making
covered
hold
intervals
12
begin
constructed
permutations
lefti
nothing
file
users
period
matches
identical
rectangular
rule
25
subtrees
cycles
win
26
specifically
decided
encoded
asked
boxes
course
ending
she
base
remains
rotated
decide
x2
sequences
open
around
stay
five
123
house
additionally
match
jump
lets
center
speed
pricei
immediately
sign
orders
transactions
say
holds
finally
earliest
3rd
low
dictionary
higher
included
swapping
recall
leaves
read
rounds
top-right
requirements
subsequent
balanced
righti
sets
remain
leetcode
performed
pop
push
queue
implementation
userid
weights
similar
colored
white
sums
subsets
overlap
inserts
a2
placing
satisfied
candies
runs
image
0th
denoted
capacity
block
associated
houses
intersection
lexicographical
applied
counted
changes
randomly
car
dollars
rank
collect
vertex
nums2i
sell
help
combination
message
overlapping
ordering
suffix
free
231
gridij
card
timei
earlier
comes
latest
concatenate
excluding
2nd
labels
querieslength
record
divides
arbitrary
pieces
later
stream
come
stock
rearranging
rectangles
bottom-left
descendant
tasks
amongst
bank
winner
draw
ignored
decrease
source
running
degrees
indexed
arrarrlength
completely
supports
balls
hand
frequent
sorting
fully
reorder
roads
half
language
pushes
fromi
toi
heights
beautiful
o1
15
sides
explanation
street
repeating
olog
intersect
doing
num2
num1
taking
segment
profit
radius
-x
wait
arrive
garden
abcde
distribute
manner
alternating
double
makes
probability
combinations
enum
triplets
country
courses
axis-aligned
island
non-zero
neighbors
productid
enter
choice
provided
x-y
y1
cut
cards
vice
versa
hhmm
symbol
expressions
obstacle
grouped
anywhere
answerlength
received
reports
increases
across
pricesi
equivalent
work
finished
g
fixed
singly
nor
ranges
methods
others
happens
generates
weighted
costi
90
indicate
selected
answer0
answer1
forms
label
year
cols
ball
workers
worker
chessboard
broken
content
previously
numsi1
support
notes
started
underlined
sold
own
flips
earn
judge
reachable
update
generate
cardinal
job
regardless
decreasing
boundary
alices
ancestor
insertion
necessary
manager
small
c1
arr2
forming
lines
endpoints
missing
slength
swaps
segments
minimized
team
towards
opposite
li
vowel
waiting
series
what
01
a1
descendants
break
abcd
calling
parallel
coins
kind
mapping
contained
movement
doesnt
satisfying
figure
traveling
food
goes
surrounded
operator
give
q
bool
stored
rearranged
sit
arithmetic
y2
exam
parts
shares
unknown
0000
mean
simple
address
cycle
4th
threshold
indirectly
numeric
department
pilesi
factor
able
property
vj
uj
requests
particular
anagram
preorder
treat
closed
multiply
absi
parenthesis
tasksi
tasked
checks
milliseconds
composed
logs
log
andor
website
addint
strs
themselves
modifying
painted
roots
corresponds
-3
chooses
diagonally
pairsi
field
30
21
printed
print
loses
pushint
her
gain
candy
eat
arrival
away
descending
mark
weighti
divisors
evenly
individually
rotating
partitions
101
procedure
custom
in-place
exact
hours
hour
fourth
drop
counterclockwise
facing
trying
blocks
stonesi
outgoing
parents
phone
chunk
allocate
formatted
20
positioned
nums2j
happy
constant
huge
shift
matching
brackets
104
objects
met
independent
evaluates
converted
teams
shape
connects
bag
us
arrives
threads
plant
rating
maximal
moved
affect
-------------------------
social
sequentially
puzzle
lose
counts
video
toward
intervalsi
splitting
132
palindromes
locations
repeatedly
picked
quantity
50
ensure
tile
1th
allows
world
did
walls
passes
completed
transaction
unless
evaluate
multiplication
evaluation
executed
whole
attend
secret
best
persons
marked
testcases
criteria
non-increasing
neither
continues
factors
shop
cause
further
conversion
future
direct
successful
occupied
timestamp
matter
opening
real
ci
leaving
access
accounts
token
tokens
emails
wi
robots
instructions
straight
forever
y-axis
black
window
median
numsn
mountain
typed
month
paint
separate
constructor
green
removal
aa
disjoint
security
unlock
24-hour
alphabetically
uses
22
differences
allow
thus
formula
capital
age
proven
various
encoding
existing
multiplied
collected
standard
lead
reconstruct
deletion
significant
partitioned
flipping
etc
games
expected
varying
beauty
frequencies
partial
duration
face
competition
inserting
infinitely
preceding
falls
fall
keeping
centered
automatically
error
chunks
returning
calendar
visits
fill
r1
send
vowels
x-coordinate
lie
cars
pivot
overall
station
passengers
thread
enough
queriesj
employeeid
00
restaurant
describe
apple
coming
includes
ace
entries
beyond
languages
memory
handle
disconnected
perm
permi
heighti
sale
kinds
optimal
jumps
replacement
coin
components
dot
sent
media
inclusively
activity
serialization
prerequisites
decode
messages
attack
positioni
reset
planted
flowers
perimeter
endpoint
candidates
rowi
neighboring
roadsi
bi-directional
diagram
writing
hi
c2
gives
downward
sitting
compute
instances
neighbor
email
server
reached
specified
tiles
60
valuesi
buildings
shorter
diagonals
321
40
maps
trip
merged
customerid
-231
percentage
rooms
outer
equally
consecutively
subtraction
roll
public
symbols
minimal
periods
instantaneously
meeting
2359
reduce
ranks
ranking
decreases
ties
discount
considering
working
project
arrange
collide
perfect
processed
unfortunately
updates
indexing
interpreted
nodeval
19
regular
nested
1234
clear
balance
track
spend
seq
undefined
resolve
constructs
session
works
named
folder
keeps
main
deletes
leetcodecom
domain
assigning
constraint
increments
star
repeats
topmost
i-th
fraction
erasing
sj
separating
yellow
causes
title
27
office
17
hamming
keyboard
16
arguments
interface
connections
boundaries
try
filling
strange
eats
n2
definition
pathsi
whenever
counter-clockwise
appended
border
sub-arrays
appends
online
jobs
xy-plane
finishes
simplified
happen
integral
calculation
appeared
script
nums3
paired
respective
2s
runtime
-2
anything
pi
bitwise-xor
135
distances
spiral
shifts
shifting
wrapping
pointer
compare
cant
turned
mathematical
booking
initialized
y-coordinate
absx
nesting
recursive
dates
passenger
bus
infected
nine
ended
distancei
simplicity
idi
disturbing
dashes
reformat
hidden
provide
slots
a0
numsl
minus
degree
mod
unable
freely
knight
23
variable
close
terms
bc
indicesi
complement
denominations
local
daily
distribution
bags
diff
orderdate
removals
mapped
14
queens
baskets
basket
alphanumeric
speedi
recover
unoccupied
collection
alternate
endtimei
starttimei
coli
blocked
details
account
stand
machine
far
picking
productname
quantities
night
planning
rob
decoded
encode
domino
lodashs
balloon
container
triangle
compared
computed
endtime
starttime
searchword
float
arrk
b2
flower
i1th
therefore
built
eating
him
dots
internal
011
traverse
else
ratio
school
numi
s3
net
passing
chose
strength
idle
computer
command
ten
labelled
knows
wikipedia
generator
yields
dice
rolls
actually
differs
islands
questions
question
gridrc
happened
lost
wordslength
travels
limited
die
grow
crosses
recursively
obstacles
execute
intermediate
treated
shapes
stores
500
anagrams
quality
selling
arrows
determined
servers
seven
reference
meetings
shared
clock
possibilities
1n
grid00
gridm
chain
signifies
whereas
ip
255
upper-case
addresses
objective
violating
destroyed
fx
zigzag
better
display
restrictions
records
market
wrong
finds
0-based
phrase
closing
half-open
finishing
cab
i0
monotone
asyncronous
identify
actions
logsi
pushed
deque
double-ended
seatsi
yj
xj
equation
though
pyramid
covers
comprises
plot
plots
sliding
234
relations
erase
deletions
yyyy-mm-dd
mm
receives
28
forest
climb
ladder
val1
val2
falling
callback
produce
big
connectionsi
arrangement
filetxt
bounds
depending
lies
forgot
run-length
compressed
experience
here
remember
coefficient
normal
simulate
stacks
implemented
candiesi
resulti
str1
str2
flight
valsi
vals
heightsi
folders
via
subgraph
lucky
matrixs
rotations
fifth
110
2-dimensional
submatrix
summation
expectednums
expectednumsi
assertions
expectednumslength
assert
nice
copy
repetition
pressed
designed
testing
entering
getint
counter
wordsj
api
participating
chess
tournament
login
walking
1-based
touching
2-d
parameters
legal
difficulty
departments
departmentid
aligned
instruction
desired
startrow
formats
arriving
pairings
sizes
slices
skip
arrleftright
12345
ability
parentsi
p1
p2
whitespace
tests
dimensions
numsleft
numsright
pointing
levels
operators
deeply
jsonparse
members
member
requires
profiti
device
r2
status
press
bookint
causing
triple
implementing
successfully
acb
timesi
signal
iterator
hasnext
in-order
representations
quadruplets
sentences
losing
calculates
throws
rate
income
deepest
ingredients
asks
k-1
restricted
numsk-1
catch
river
plants
eight
---------------------------
05
001
commas
occurring
apples
reaching
movies
movie
res
unchanged
averages
numsr
painting
dollar
distributed
everyone
aforementioned
lock
abcc
assignment
arr1i
arr2j
valuei
eventsi
lands
010
itemsi
appending
critical
someday
activities
distributions
n-ary
nary-tree
nums1j
triplet
nums1length
relationship
prerequisite
force
existed
loss
matij
component
themself
an-1
listed
attain
ki
cd
engage
booleans
movements
gridrowcol
configuration
salaries
numcourses
prerequisitesi
contest
widths
splits
--
logged
sales
fuel
robber
contact
stashed
alerting
police
worked
uncommon
conflict
context
correspond
dominoes
frog
bar
visiting
parenti
locked
unlocks
known
two-dimensional
uncolored
json
structurally
colorsi
balloons
statement
show
videos
temperature
eaten
mouse
backwards
recent
--------------------------
tuples
amounts
libraries
bsts
denominator
fractional
stations
traveled
f1
composition
guards
driving
drive
rearrangement
view
immediate
six
parameter
route
unsigned
pays
customersi
upcoming
valued
ignoring
312
root1
root2
eventually
reading
preferred
interested
importance
non-space
manhattan
managers
delay
xy
tower
weightsi
trips
rectanglesi
maximizes
queen
solved
acyclic
sn
buying
decrement
subgrid
banned
journey
connection
connect
0-9
32
aab
routes
reduces
i1
bloom
occupy
sub
bought
magical
picks
individual
occupies
few
xn
fibonacci
behind
determines
6-sided
counting
evaluated
numerals
accept
begins
checked
t2
t1
held
allocated
ring
spell
alphabetical
poor
warehouse
cross
old
cutting
execution
len
sometimes
respect
positionsi
floors
comprise
bobs
executing
besides
refer
scheduled
delivery
acceptable
enhances
usual
environment
reversing
likely
solutionint
elapsed
boardrc
unrooted
getting
spread
graphij
arrivali
euclidean
origin
ever
selecting
section
colori
reject
hire
submatrices
contents
cuts
factory
preparing
drives
dropped
numsnumslength
wish
owner
enters
linear
principle
75
startpos
drawing
non-leaf
xth
--------------------
managerid
fair
59
paid
applies
simply
viewed
hello
entirely
finding
imagine
bricks
alength
stays
jumping
1-9
frame
meetingsi
0190
words1
words2
cartesian
e1
e2
union
rx
personid
tries
forth
cba
attendance
late
absent
award
eligible
alphabetic
studentid
subjects
teacher
university
subject
ipv4
19216811
continuously
projects
week
asteroids
mass
gains
asteroid
f3
upon
blank
recorded
updateint
incorrect
2th
typically
inner
pid
displays
tag
tracks
partially
numerically
energy
consistent
patterns
intersecting
answersi
powers
potentially
expiration
action
extended
performs
popped
isempty
rear
isfull
mail
dash
modifications
pointslength
preserved
faces
anti-clockwise
stands
farmland
inverse
3x
selection
groupi
belonging
backspace
labelsi
lower-case
ij
separation
row2
col2
col1
row1
excel
sheet
1100
strongest
dist
coprime
leftright
optional
optionally
duplicated
transpose
trim
trimmed
applications
efficiently
insertstring
searchstring
supposed
ccc
marking
i-1th
tic-tac-toe
printer
chef
chalkboard
natively
supported
fifo
peekpop
doctors
likes
giving
partitioning
departure
departs
tickets
ticketsi
look
abcdefghijklmnopqrstuvwxyz
chars
namesi
bug
180
flipped
non-intersecting
layers
cyclic
layer
afterwards
creating
1d
things
important
newly
presses
tested
training
train
opponents
incremented
putint
invalidate
frequently
extending
startvalue
uniquely
wordlength
fancy
shaped
dropping
spans
hits
spanning
corners
-k
attempts
instructed
ascii
crossing
staircase
ancestors
bash
456
replaces
insertint
housesi
sub-array
empid
contrast
012
210
page
3n
pizza
slice
linked-lists
heads
ahead
correctly
1101
matched
url
browser
history
images
genetic
vali
angles
excluded
preserving
digitsi
index2
index1
shiftsi
innermost
non-null
computing
comparing
plan
laser
join
interfere
bulbs
buttons
button
yield
reordered
2x
numsa
numsb
numsd
numsc
calculations
effect
bomb
buffer
k2
k1
maintain
absnumsi
collides
collisions
staying
collision
stonevalue
thrown
bracket
flattened
multi-dimensional
cheese
numsn-1
numsk1
buses
prints
console
printnumber
refill
watering
plantsi
uninfected
repaired
repair
ranksi
filter
years
0001
comma
restaurants
maxdistance
filtering
ratingi
xs
aec
distributing
searchint
cheapest
drops
listinteger
carries
rented
joined
encodedi
decrypt
decrypted
gap
removeduplicatesnums
kept
a4
odd-indexed
even-indexed
a3
majority
numsl1
numsr-1
ideal
274
242
4237214
33
costij
yet
nobody
turning
dead
wheel
stopped
uniformly
increased
book
stick
single-space
arr1length
programming
well-formed
speciali
0110
s0
enddayi
attending
startdayi
home
eee
targets
-9
gcdx
edgesj
transformed
realized
non
activitytype
cookies
postorder
nums2length
nums2i2
info
orderid
buyerid
sellerid
2019
incoming
11106
06
18
grouping
a-z
aajf
kjf
n-queens
eliminate
kilometers
rangesi
swapped
enemy
refers
ages
agesi
sends
0124567
an-2
4567012
rowj
colj
gridrowicoli
105
abcba
bacd
modifies
aaa
sleftirighti
cooldown
converts
retrieves
graphs
snake
knights
colsum
category
dial
pad
warm
numarrayint
numarray
sumrangeint
wide
pixels
ranked
worst
afterward
aj
super
machines
left-to-right
gamesplayed
deviceid
eventdate
logging
playerid
triangular
bac
stacked
sij
quarter
liter
liters
ride
professional
robbing
tonight
systems
depthb
depths
vps
maxdeptha
deptha
vpss
foods
short
service
durationi
parents0
family
requirement
obeys
ranging
tied
votes
resolved
hands
halves
mixed
elevation
parent0
locks
s1i
multiplicity
newnumsi
newnums
touches
smash
choices
rope
judged
attempt
temperatures
files
forwards
vote
cinema
maxsize
involving
transferred
10000
ycenter
xcenter
circumference
uniform
flights
reserved
firsti
removekey
hash
treesi
gardens
classes
stationsi
rides
f2
gone
faster
one-lane
miles
assumed
fleet
carpetlen
tilesi
picky
situation
definitely
answerx
songs
song
timej
angle
guesses
guessed
exceeding
took
master
guess
strategy
compiler
notation
java
5th
exit
ground
safely
drawn
scoresi
older
specify
favorite
axes
furthermore
reformatted
soldiers
weakest
singly-linked
xi2
xi1
213
defines
effective
sourcei
quote
answerj
indirect
companys
holding
disconnect
boxesi
cubes
viewing
ship
port
limits
carry
king
bill
buckets
fed
bucket
feed
const
ticket
skill
peoplei
skills
indexes
findint
rootval
contaminated
key-value
describing
extract
differing
maxtime
fee
load
engineer
efficiency
performance
speeds
fruits
fruit
exclusive
aba
password
ik
flowersi
floating
meters
unlimited
sessions
computers
convex
polygon
reside
primes
mid
abbreviated
list2
list1
serialized
comma-separated
cherries
army
kingdom
strengths
34
guarantee
communicate
permitted
keysi
lakes
dont
relation
ignore
2020
february
guarded
rollsi
live
120
molecule
percent
2k
fnarri
totally
diameter
fs
init
peak
signs
exchange
subordinates
convenience
variables
protected
concept
overlapped
delayed
unused
half-closed
rings
align
metal
smart
skipped
party
fibonacci-like
resources
345
searches
pref
pig
liquid
allotted
coinsi
a-b
burst
bursting
sure
efficient
waits
volume
cancelled
400ms
30ms
50ms
100ms
60ms
mine
mines
unrevealed
revealed
examine
typing
obstaclesi
past
piecesi
designated
paper
solving
matrixij
inorder
provides
cpu
resultant
photo
attributes
logical
--------------------------------------
tweets
tweet
app
x0
unary
term
64-bit
worth
powx
optimize
save
graphi
safe
youre
cat
walked
awesome
nums0i
traversing
success
si1
lying
targetx
targety
row-wise
supply
worry
adjacency
minitial
malware
infinity
nums2i1
freq
successor
truck
glass
eval
squared
commands
queryint
57
sake
costsi
factorial
directory
reply
tells
ugly
tallest
limitj
cipher
transformation
1001
max
erased
matrices
tripsi
movesi
completes
shouldnt
promises
promise
pending
penalty
unsorted
divisibility
wooden
spreading
simulates
layout
mode
surface
bad
vice-versa
deposit
withdrawint
depositint
withdraw
avoid
arrived
stocks
nextint
collects
triangles
attribute
startcol
entrance
captured
025
pool
matrixrowcol
targeti
requestsi
former
latter
js
processes
installed
library
sections
ty
sx
tx
sy
minimizes
foo
typei
solvable
gridi
invert
arrow
fashion
ch
self-edges
hh
entry
decki
deck
widthi
got
saleid
expansion
entered
400
usually
900
xii
numeral
roman
xxvii
ii
iiii
xx
ix
iv
truncate
seed
aeb
aebdc
merging
obtaining
popular
views
placement
gold
slash
executes
cups
cup
lca
shuffled
transfer
transfers
originally
dominoesi
permute
rightward
ant
iterates
shot
flat
parser
million
node2
node1
seqi
seqlength
xxxx
24
indexi
maxi
mini
b1
cached
memoized
reminder
tuesday
puts
sunday
monday
planting
brick
sub-boxes
sudoku
collecting
traversed
flood
dies
someone
transactionsi
citys
skyline
contour
spreads
situated
reduced
magic
copies
secrets
firstperson
post
3456
3951
0158
6345
cycled
digital
rabcdefgh
rw
grammar
abdfh
concatenations
rabcd
abdfg
rabbc
acdfg
rexpr
acefg
abefh
acadbcbd
abefg
rabc
re2
acdfh
understood
ek
comma-delimited
re1
acefh
ra
singleton
lastname
addressid
firstname
bars
trivially
abac
predecessor
word3
worda
wordb
bcad
wordk
self-dividing
128
unreachable
abe
negativefeedback
feedback
reporti
positivefeedback
studentidi
teaches
subjectid
teacherid
deptid
020010db885a3000000008a2e03707334
x1x2x3x4x5x6x7x8
20010db885a38a2e037j7334
x1x2x3x4
2001db885a3008a2e03707334
queryip
ipv6
19216810
192168100
20010db885a3000000008a2e03707334
xilength
hexadecimal
192168011
pricesj
milestones
milestone
violate
weeks
milestonesi
asteroidsi
planet
f11
convention
39916800
18291174312
21347112918
convertstring
numrows
legibility
paypalishiring
font
pahnaplsiigyir
gcdnumsi
requestsj
restrictionsi
resultj
volatile
nature
worse
stockprice
correcting
floorx
floorpilesi
toggling
by1
rectilinear
bx2
ax2
by2
bx1
ay2
ay1
ax1
nodeleft
traverses
noderight
issue
unmatched
tagcontent
validator
parsed
forbid
note1
cdatacdatacontent
snippet
cdatacontent
parse
wrapped
unbalanced
tagname
tags
tagnametagcontenttagname
cdata
1232
2234
deviation
8-directionally
insertions
addrangeint
removerangeint
tracked
rangemodule
queryrangeint
overlaps
tracking
module
actuali
minimumi
require
bba
bbabba
bababcba
iquerieslength-1
p123m
classs
superclass
sleeps
millis
wealth
richest
accountsij
insufficient
powersj
alicevaluesi
differently
alicevalues
bobvaluesi
bobvalues
authenticationmanager
renews
authentication
generatestring
countunexpiredtokensint
currenttime
renewstring
expiry
timetolive
renew
renewed
expires
tokenid
unexpired
countunexpiredtokens
expire
authenticationmanagerint
deletefront
insertlast
getfront
deletelast
mycirculardequeint
mycirculardeque
getrear
insertfront
e-mail
e-mails
underscore
studentsj
unmodified
x-values
countintervals
chargetimesi
chargetimes
maxchargetimes
sumrunningcosts
runningcostsi
budget
charge
runningcosts
tars
similarity
rats
arts
farmer
apex
pyramidal
bottommost
fertile
barren
subjected
numsnumsnumsk
numsnumsk
sk
beforeitemsi
complementary
ologarrlength
lr
alal1ar
homogenous
editors
backspacing
apr
mar
sep
1900
dec
jun
feb
jan
yyyy
nov
30th
2100
jul
31st
oct
dd
aug
10921
rowcol
newvalue
getvalueint
subrectanglequeries
updatesubrectangleint
subrectangle
row1col1
row2col2
variation
zuma
columnnumber
todelete
keytimei
keyname
2352
emits
2251
key-cards
keycard
0949
doors
2351
keytime
key-card
keynamei
alert
one-hour
saves
non-star
stars
arrm
-7
stronger
referred
refereeid
properly
brokenletters
malfunctioning
rung
rungs
validly
gcdval1
numsy
numsw
numsz
numsx
toeplitz
nodejs
listeners
emit
subscriptions
callbacks
emitted
eventemitter
subscribed
enables
dom
unsubscribe
emitting
subscribing
subscribe
referentially
enjoy
enjoyyourcoffee
coffee
h2o23
atom
h2o2
chemical
h1o2
h2o2he3mg4
formulas
h2o
atomic
ministry
transport
narrow
reorienting
orient
endi-1
pairslength
ryan
trimming
trie
startswithstring
pronounced
autocomplete
dataset
retrieve
spellchecker
whitespaces
compress
compression
a2bc3
c3
aabccc
groupsi
forgotten
adjacentpairsi
adjacentpairs
satisfactioni
satisfaction
prepared
preparation
dishes
dish
cook
like-time
discard
myqueue
peek
candytype
candytypei
noticed
advice
doctor
advised
kids
extracandies
kid
bolded
abcabcabc
str
n1
abdbec
solid
targetgrid
targetgridrowcol
dateid
partnerid
leadid
partner
makename
partnerids
leadids
dailysales
airports
airline
lga
jfk
lgb
itinerary
itineraries
man
lexical
wraparound
zabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcd
peoples
ax
onetwothree
underlying
axy
subfolders
bx
bxy
az
bw
bz
subfolder
src2
src1
dest
lastly
constituent
mirrored
alone
root-to-leaf
01101
32-bits
switching
non-prime
minlength
cyclically
111
10111
1-dimensional
reordering
maxm
2m
sortnums
removeelementnums
equaling
actuallength
subdivide
cnti
xcnti-1
xcnti
maxmoves
x3
abaacc
copied
screen
notepad
paste
minb
released
releasetimes0
keypress
tester
keyspressedi
releasetimes
keypresses
keypad
keyspressed
releasetimesi
initialenergy
defeat
experiencei
energyi
initialexperience
defeating
opponent
lfucache
lfucacheint
recently
invalidated
cache
lfu
maintained
fixed-width
widest
destvalue
step-by-step
bcfd
abca
abacba
multallm
inc
addallinc
multall
appendval
addall
getindexidx
idx
multiplies
midnight
2345
0130
0015
logintime
logout
logouttime
seventh
0045
cellsi
flooded
cith
rith
02
03
additive
cube
storeroom
cubic
redirect
stuck
boards
redirects
handy
matlab
reshape
reshaped
wanted
row-traversing
schedule
jobdifficultyi
difficulties
jobdifficulty
dependent
lonely
maxlocal
maxlocalij
instructs
getpos
robotint
getdir
retries
stepint
awaits
independently
xtarget
ghosts
ytarget
escape
ghost
ghostsi
pac-man
recolor
blocksi
monotonic
startcolumn
maxmove
kthlargestint
kthlargest
oriented
one-liner
xxx-xxx-xxxx
7890
456-7890
xxx
xxx-xxxx
987-123-4567
defanged
bbbbb
os
orderedstream
eeeee
valuelength
concatentating
osinsert4
osinsert1
idkey
ccccc
ddddd
orderedstreamint
osinsert5
osinsert3
orderedstream5
osinsert2
aaaaa
mailbox
mailboxes
supervisor
bonus
0120
001112
web
developer
pages
n-digits
1337
pizzas
gregorian
skipa
headb
skipb
intersected
retain
lista
heada
intersectval
listb
comprising
-23
-22
-20
nums1leftright
sumnums2
sumnums1
sumarr
11231415
nums2leftright
1121345
1112131415
trainers
trainersj
playersi
trainer
matchings
leftover
browserhistoryback7
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
googlecom
backint
facebookcom
homepage
browserhistoryback2
browserhistoryvisitgooglecom
visitstring
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
tab
forwardint
5000
clears
browserhistorystring
browserhistoryforward1
urllength
browserhistoryforward2
browserhistory
browserhistoryback1
browserhistoryvisitfacebookcom
browserhistoryvisityoutubecom
forwarding
browserhistoryleetcodecom
linkedincom
youtubecom
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
homepagelength
browserhistoryvisitlinkedincom
excellent
nodei
parentsx
90-degree
p4
p3
bce
cae
non-horizontal
-123
103
mex
baa
abcbabcbcb
ababbc
ac
averagea
averageb
averagearr
1351315
551
numberslength
numbersindex2
numbersindex1
presented
evil
numsleft1
directioni
typewriter
uni-value
end-nodes
2i
sumnumsi-numsj
obj2
obj1
schemes
participates
commit
minprofit
crimes
participate
crime
profitable
scheme
anti-theft
beams
activated
beam
while1
banki
devices
statuses
functionality
3k
num1num2
mycalendartwo
unnecessary
differencei
differenceij
equal-length
wordsij
wordsij1
freqstack
stack-like
mynumbers
bstiterator
bstiteratortreenode
non-existent
initializing
advance
advances
sentencesi
careful
bombsi
felt
bombs
detonate
detonated
gaining
tokensi
interesting
stationary
directionsi
involved
collided
motion
percent2
tax
percent1
bracketslength
earned
bracketsi
upper0
percent0
upperi
taxes
percenti
upperi-1
taxed
upper1
upper2
bound
operationsi0
operationsi1
flattening
arrayflat
jumbo
totalsmall
totaljumbo
tomatoslices
tomato
burger
burgers
cheeseslices
visitdate
stadium
zk
zi
z2
zi1
distancetolastnodezi
z0
distancetolastnodezi1
distancetolastnodex
z1
0124445667
4566701244
busesi
passengersj
printbuzz
fizz
printfizz
fizzprintfizz
fizzbuzz
printfizzbuzz
fizzbuzzint
buzzprintbuzz
numberprintnumber
fizzbuzzprintfizzbuzz
buzz
early
infection
mechanics
garage
mechanic
answerslength
incidenta
answersj
ologm
smoother
grayscale
img
surrounding
rounding
projectid
experienceyears
extraneous
000
205
filters
veganfriendlyi
restaurantsi
maxprice
veganfriendly
querycharacters
queryindices
lengthsi
querycharactersi
queryindicesi
hasapplei
hasapple
00010
10010
ys
00001
explore
theres
10th
tenth
mat20
mat42
mat31
incompatibility
incompatibilities
shopi
shops
movierentingsystemint
rental
shopj
rentint
unrented
searching
generating
moviej
resj
rents
moviei
rent
renting
entriesi
dropint
movierentingsystem
listlistinteger
fixed-bound
mink
maxk
wordjn-1
wordin-1
lcp
lcpij
aaca
aabd
reformatting
formatting
firstly
1021
proved
coden-1
defuse
informer
code0
shifted
repetitively
nummatrix
nummatrixint
sumregion
sumregionint
reindexing
4253
self-loops
12233211
neighborhoods
neighborhood
summer
mycalendar
rabbits
rabbit
1238
5678
5674
slot
deadends
codes
wrap
wheels
illustrated
orthogonal
thickness
books
shelfwidth
thicknessi
shelf
shelves
bookcase
booksi
bookshelf
matchstick
matchsticksi
matchsticks
link
updated
preceded
1e5
arr2length
decrements
--x
x--
practical
curried
sum123
csum123
offers
specialin
specialij
offer
needsi
great
1110
forbiddeni
forbidden
bugs
sources
sourcesi
targetsi
abbc
testcase
replacements
eeecd
314
e3
6e-1
535e93
99e25
--6
2e10
1e
-90e3
-123456e789
3e7
1a
95a54e53
0089
-01
reti
ret
items1
items2
numsansi
doubled
shuffling
requestaccepted
requesterid
accepterid
acceptdate
wrote
seperate
maxima
mindistance
minima
maximaminima
sendmessage
active
opensession
2019-07-27
scrolldown
endsession
activitydate
sessionid
cookiesi
unfairness
nums2k
nums1k
nums1i2
shopping
itembrand
itemid
joindate
buyer
favoritebrand
102001
121000
approved
declined
transdate
nextcoursei
relationsi
semesters
semester
prevcoursei
decoding
earth
invented
rick
morty
discovered
universe
stated
magnetic
c-137
2d-array
defending
monster
charged
disti
weapon
monsters
chargethe
mistake
teemo
attacking
timeseriesi
poison
ashe
poisoned
timeseries
hero
attacks
timer
flowerbed
no-adjacent-flowers
neededapples
growing
iteration
sized
numsij
bij
maxbik
125
multipliers
multipliers0
multipliers1
multipliersi
func
mysterious
funcarr
winston
candidate
exclusively
cornered
2p
0011
1111
agex
agey
gridrowjcolj
illuminates
illuminated
ansj
answering
lamps
lamp
lampsi
aacabb
bs
bbcbaa
aecdb
abba
baab
queries2
falsetrue
truefalsefalsetruetrue
queries3
010221
queries4
queries1
330120031032041
queries0
palidrome
lyb
abcda
preserve
colums
lexographically
minstack
getmin
retrieving
heshe
n-2
horizontalvertical
nn
illustrates
gridrowcolth
0-thupper
colsumi
column0-indexed
1-stlower
removequeries
removequeriesi
intersections
categories
monthly
50000
accountid
20000
subsequence1
subsequence2
diagaram
indicated
almost
cousins
warmed
heater
winter
heaters
numsindex
result1
widths1
result0
widths0
scenic
attractiveness
queried
invoked
invocation
querying
tracker
sortracker
addstring
0156
dress
dresses
washing
sleft
sright
lo
pointsrc
absc1
solitaire
x1x2xny1y2yn
x1y1x2y2xnyn
three-letter
aesthetically
pleasing
stacking
beneath
sxy
saledate
unitprice
2019-03-31
2019-01-01
divisions
102
73
representative
representatives
quantityi
k-sum
stopping
depthc
tiring
non-tiring
well-performing
third-largest
122
distinctly
second-largest
meal
deliciousnessi
deliciousness
meals
httptinyurlcom4e9iak
encodestring
restriction
decodestring
httpsleetcodecomproblemsdesign-tinyurl
tiny
longurl
shorturl
encodedecode
tinyurl
shortening
companion
xvalue
coursesi
lastdayi
flipsi
prefix-aligned
voters
position-one
voter
downwards
couples
switch
couple
bottoms
tops
bottomsi
topsi
croakoffrogs
printing
croaks
croak
frogs
raining
trap
streak
lengthwordi
lengthwordj
numsi-1numsj-1
grades
unlocked
upgrade
upgraded
lockingtree
upgradeint
prevents
lockint
lockingtreeint
locking
unlockint
s2j
twins
n-1-ith
twin
prefixi
warrior
wrr
universal
minnums2
maxnums2
thereafter
routine
pictorial
features
arraywrapper
numpeople
gift
chunked
popping
frontmost
popback
frontmiddleback
popmiddle
pushfrontint
pushbackint
popfront
pushing
pushmiddleint
colorful
neededtime
neededtimei
disqualification
mountainarray
submissions
circumvent
mountainarrgetindex
mountainarraygetk
mountainarraylength
mountainarrayget
interactive
mountainarr
12335
1235
instructionsi
min2
driver
compile
upload
uploaded
uploads
luprefix
luprefixint
uploadint
recorddate
yesterday
weather
reward2
reward1i
reward1
reward2i
mice
mycalendarthree
k-booking
magicdictionary
builddictstring
employeeuni
uniqueid
topvotedcandidate
personsi
topvotedcandidateint
qint
cast
election
deci-binary
3001
112
description
genre
odd-numbered
boring
pops
incint
customstackint
customstack
transid
transactedon
solutiondouble
randpoint
therere
quadruplet
bookings
bookingsi
lasti
hashmap
myhashmap
treesj
enrolled
countuniquecharss
countuniquecharst
enclose
numerator
government
sanctioned
pre-existing
travelleddistance
gx
fghx
hx
fnx
identity
integer-sided
koko
bananas
bananas-per-hour
slowly
loves
fleets
bumper
slower
catches
slow
carpet
hhhvv
providing
hvhvh
arrlen
pairwise
hasfrequencyint
frequencytracker
regarding
deleteoneint
0011255245
012201
1921681312
numsi-1
patientname
patientid
diab1
diabetes
patients
hospital
xyzz
zzxy
xzzy
special-equivalent
trios
trio
newinterval
consisiting
gcd
quieti
logically
richer
quiety
quiet
quietness
richeri
loop
cityai
citybi
uselimit
numwanted
posy
determining
posx
angle2
vision
obstruct
bruteforce
allowedguesses
masterguessword
six-letter-long
helper
masterguess
reasonable
largest-valued
src
dst
flightsi
001101
inspection
variety
official
centennial
serving
gondola
boardingcost
gondolas
runningcost
scenario
lattice
circlesi
circles
younger
basketball
conflicts
bigger
ordernumber
customernumber
revision
revisions
2533
version1
version2
seating
invited
organizing
capable
favoritei
license
numsii
357
numsinumslength
159
n3
weaker
civilians
wildcard
yi1
rectanglei
yi2
labeling
listing
leaf-similar
implicit
control
comment
macros
newline
comments
precedence
hats
wear
hatsi
cbtinsertertreenode
getroot
cbtinserter
treenode
sub-folders
sub-folder
leetcodeproblems
folderj
folderi
telephone
2-9
receptor
southwest
mirrors
receptors
ray
seeing
earns
earner
earners
executives
left-justified
justified
approach
greedy
pack
maxwidth
brings
losers
progression
absx1
absy1
pencils
pen
cost1
pens
cost2
pencil
utensil
0316227
3627
harmonious
arrrighti
arrlefti
reportsto
anyone
reporting
k-repeating
discovers
forget
discovering
zx
shadow
projections
looking
projection
yz
3-dimensional
planes
k-diff
portsi
maxboxes
delivering
portscount
loaded
delivered
deliver
storage
ports
maxweight
46
maxlen
passi
beforehand
brilliant
ratios
classesi
totali
extrastudents
patterni
minn
ad
yqueeni
xking
yking
queensi
xqueeni
123450
relationsj
months
nextcoursej
prevcoursej
ca
prepending
abaca
aca
lemonade
billsi
bills
hamsters
hamstersi
hamster
salad
taxrate
taxprice
functioncall
taxcallpolyfillitem
totalcost
callpolyfill
tax10
appropriately
obj
thisitem
consolelogthe
appropriate
enhance
queuing
natural
6th
people0
sufficient
people3
people1
reqskills
dfs
depth-first
recovered
treenodeleftval
treenoderight
findelements
treenodeleft
treenoderightval
findelementstreenode
recovers
treenodeval
sumstring
key-val
mapsum
overridden
skilli
chemistry
artifact
digi
dig
c2i
uncovered
underneath
excavate
r2i
artifacts
artifactsi
buried
mud
r1i
c1i
arrbannedi
bring
bannedi
inversions
global
toggle
bulb
variance
passingfees
passingfeesj
fees
countsi
conveyor
package
shipped
packages
belt
engineers
efficiencyi
size1
size2
dislikes
dislike
dislikesi
mutating
mutate
changenumi
streets
upper-left
basket2
minbasket1ibasket2j
basket1
exchanges
less-than-or-equal-to
fractions
-1073741825
violates
strong
locationsj
locationsi
locationslength
minnumsi0
maxnumsi0
heroes
numsik2
numsik
alex
poeplei
3200
kelvin
fahrenheit
27315
celsius
carsi
slowest
unite
positioni1
sessiontime
ethernet
cables
monkey
monkeys
108
12321
express
1234589876e5
presuf
546
1234567654321
1234567
suf
pre
abbreviate
presufec
1234554321
12345678987600000
conversions
invertx
reverseinvertsi
s4
reversex
inverts
0111001
011100110110001
positives
omit
one-to-one
list2j
list1i
joins
primaryflag
flag
remainder
encounter
serialize
sentinel
934126
productkey
cardpoints
pill
workersj
requiring
pills
favoritecompaniesi
companies
favorites
favoritecompanies
wizard
strengthi
wizards
ruler
jobsi
devise
aisle
reservedseats
exceptional
four-person
38
reservedseatsi
friendship
teach
languagesi
transitive
friendships
friendshipsi
wallet
assorted
encrypt
carried
encrypts
decryption
encryptstring
decryptstring
encryption
encrypted
encrypterchar
encrypter
horizontallyvertically
isnt
2h
xn-2
xn-1
gifts
shifta
shiftt
shiftz
atoi
clamp
clamped
0032
non-digit
myatoistring
ccs
rated
createdat
review
movieid
movierating
obstructed
guardsi
guard
wallsj
fortunately
observation
went
observations
truncates
avgsi
k-radius
275
avgs
extroverts
living
happiness
introvert
extrovertscount
introvertscount
extrovert
introverts
side-length
boomerang
usage
usa
capitals
google
useful
studying
10-letter-long
nucleotides
acgaattccg
dna
groceries
supermarket
getbillint
paying
frequented
amountj
productsi
purchased
productj
subtotal
cashier
cashierint
transmission
2266622
pressedkeys
texting
arrayfilter
truthy
49
1549
fixed-length
roomsi
linked-list
arrangements
1412
14312
truefalse
answerkey
ts
maximizing
answerkeyi
falses
trues
confuse
createcounter
logn
logm
om
numbottles
bottle
drink
numexchange
bottles
drinking
infrastructure
fish
fisher
maxvalue
newi
mappingsi
mappings
oldi
employeesisubordinates
employeesiid
employeesiimportance
scopes
mult
expr
vn
v1
lisp-like
v2
en
scope
syntax
getaveragetime
checkinint
checkoutint
underground
checkin
getaveragetimestring
railway
undergroundsystem
chronological
startstation
endstation
stationname
checkout
tleft
tright
belonged
higheri
remembers
loweri
winneri
defeated
outcome
loseri
matchesi
redistribute
numcarpets
carpets
visible
floori
pressing
anticlockwise
keyword
quest
stage
fallout
1200
trail
spelled
engraved
spelling
purpose
door
freedom
keyi
countj
pointsj
victory
voting
predict
round-based
dire
dota2
senators
announce
senator
radiant
rights
ban
exercise
senate
parties
routesi
routes0
header
tablenumberi
customernamei
fooditemi
ordersicustomernameitablenumberifooditemi
chart
stockpricesi
dayi
stockprices
plotting
12344
14234
popatstackint
dinnerplates
dinnerplatesint
lays
homework
querytime
pure
venture
ipo
soon
capitali
profitsi
444
suff
fstring
wordfilter
wordfilterstring
skiplist
45
304050607090
httpsenwikipediaorgwikiskiplist
red-black
by-sa
ologn
idea
kalinin
comparatively
eraseint
80
wikimedia
treap
cc
artyom
fine
commons
skiplists
subtext2
subtext1
subtextk
subtexti
ceilval
ceilnumsi
ceiling
consume
minutestotest
pigs
minutestodie
poisonous
survive
containskey
myhashset
hashset
addkey
irreducible
asdfghjkl
zxcvbnm
qwertyuiop
american
autoincrement
wisely
2d-plane
righttoleftj
warehouses
bridge
righttolefti
lefttorightj
regulate
putnewi
lefttorighti
pickoldi
bulky
heavy
distancethreshold
stickers
sticker
oranges
kitchen
orange
debounced
recieve
150ms
debounce
35ms
135ms
95ms
clickc
minesweeper
char
clickr
revealing
click
801
243
243801
803
243803
rolling
sided
taller
up-left
chips
chip
orderwith
ababc
rooks
bishop
rook
bishops
c-1
r-1
numsdivide
relaxation
manages
sixth
labelling
hiddeni
differencesi
questionsi
decision
brainpoweri
relevant
minesi
gridxiyi
arms
terminates
backsi
frontsi
fronts
backs
triples
gender
1end2
single-threaded
0start3
endtimestamp
functionidstart
sprefix
ssuffix
asuffix
bsuffix
aprefix
bprefix
bottomleft
quad-tree
terminator
quadtree1
recurse
sub-grids
matrixes
topleft
sub-grid
bottomright
quadtree2
inputoutput
wiki
isleaf
topright
proper
customerprefdeliverydate
deliveryid
precisely
zero-based
numsnumsi
tweetid
arraygroupbyfn
groupby
y0
aabc
-2aaa
3bb
well-formatted
evalvars
5c
lexicographic
-1a14
alternates
asterisk
evalints
breaking
-6
4a
3aab
uniquecnt1
divisor1
divisor2
uniquecnt2
counti
typesi
marksi
indistinguishable
trimi
kith
raised
detectsquares
countint
perpendicular
resets
40ms
throttle
throttled
overwrite
80ms
newprice
changedate
2019-08-16
terminal
leads
username
decimals
registered
register
contestid
score0
score25
score1
neg
pos
jewels
sensitive
steals
capability
robbed
homes
refuses
steal
ccatmmouse
mousejump
catjump
cookie
gi
greed
appeal
abbca
least-significant-bit
most-significant-bit
lockedi
1e-5
succprobi
heaviest
scramble
scrambled
rmove
cmove
numsri
numsli1
-5
numsli
bcdea
leavetimei
implies
acd
basestr
equivalency
symmetry
s2i
transitivity
equivalence
reflexivity
cde
eed
minimums
suggested
suggests
incurred
y2i
starty
y1i
x2i
x1i
startx
specialroads
specialroadsi
productofnumbers
productofnumbersaddaddaddaddaddgetproductgetproductgetproductaddgetproduct
overflowing
productofnumbersgetproduct4
302548
productofnumbersgetproduct3
getproductint
productofnumbersadd8
nullnullnullnullnullnull20400null32
productofnumbersadd0
3025423482
productofnumbersadd2
3025
productofnumbersadd3
productofnumbersgetproduct2
getproduct
30254
productofnumbersadd5
productofnumbersadd4
302
retained
reversed2
2021
reversed1
12300
1202
fw
fqueriesi
dcce
column-wise
demand
putrightfork
asking
pickleftfork
wantstoeatphilosopher
putleftfork
spaghetti
bowls
concurrent
silent
forks
discipline
alternately
wikipediaorg
fork
stomach
pickrightfork
behaviour
philosopher
think
philosophers
starve
thinking
row2i
col1i
matxy
queryi
row1i
col2i
barriers
bond
releaseoxygen
barrier
explicitly
releasehydrogen
bind
synchronization
enforces
hydrogen
molecules
oxygen
targetfriend
chair
leavingi
chairs
sublists
decompressed
sublist
successors
sequential
arr2i
arr1j
no-zero
trucks
garbagei
garbage
responsible
traveli
assortment
basic
calculator
nums3k
nums4
nums4l
services
pickupdelivery
pickupi
deliveryi
pickup
changeratingstring
highestratedstring
newrating
ratings
highest-rated
cuisinesi
ratingsi
foodsi
cuisine
foodratingsstring
foodratings
cuisines
-y
odd-length
sqrt2
579
flength
fi
123456579
simulator
introduced
rollmax
rollmaxi
dag
indexdiff
valuediff
rangefreqquery
rangefreqqueryint
converting
converi
maxarr0i
conver
rightj
segmentsi
145177
246
mix
1412477
thin
leftj
mixj
rather
47
paintingj
expressed
exceeded
fullfill
followerid
follower
followers
isomorphic
original0
derivedi
originali
prior
327712
hiring
32772
matrixxy
clumsy10
clumsy
factorial10
f2content
f2txt
fntxtfncontent
f1txtf1content
f1content
f1txt
f2txtf2content
fntxt
directorypathfilenametxt
fncontent
rootd1d2dm
lazy
guessesj
says
onlogn
diffi
particularly
subtracted
golf
subexpr1
subexprn
subexpr
subexpr2
figures
roboti
factoryj
positionj
factories
repairs
till
prepare
prepares
substitution
boy
substituted
appearance
presence
valuesj
spot
spots
sightseeing
cherry
thorn
advantage
productcategory
store3
store2
store1
wrap-around
closer
left-out
alter
img1
translate
translation
translated
img2
borders
myemailcom
emailsi
everything
forwarded
alicezleetcodecom
mails
filtered
aliceleetcodecom
mynameemailcom
xoring
xor-beauty
initialboxes
statusi
containedboxes
containedboxesi
slant
countandsayn
countandsayn-1
saying
count-and-say
countandsay1
3322251
numsnumslength-1
middleindex
numsmiddleindex1
numsmiddleindex-1
numsmiddleindex2
150
vehicle
numpassengersi
eggs
breaks
unbroken
certainty
reuse
egg
24130
13024
magnitude
irrelevant
throw
settimeoutresolve
yielded
t100ms
t50ms
responsibility
promiseresolve
cancel
rejects
caught
settimeoutcancel
promisecatchconsolelog
resolve2
cancellable
cancellabletasks
bookstore
technique
grumpyi
grumpy
throughout
marble
weightsj
marbles
mycircularqueuek
enqueueint
dequeue
mycircularqueue
benefits
grain
wood
incur
closes
divi
div
word0i
aalength
sticks
cutsi
amounti
gate
reward
pricereward
cash
suitsi
flush
case-sensitive
suit
suits
poker
urgent
inform
managerheadid
subordination
headid
relationships
manageri
news
informtimei
aval
bval
super-palindromes
super-palindrome
examroom
sits
examroomint
leaveint
mxy
opsi
ops
histogram
histograms
concert
ticketing
spectators
maxrow
gatherint
hence
allocates
hall
bookmyshowint
bookmyshow
scatterint
vary
fingers
1-d
2-1
countk
statistics
sample
floating-point
3d
glue
irregular
splicing
banknotes
prioritizes
200
600
banknotescount
300
banknote
withdrawing
handed
rejected
deposits
atm
boredom
playlist
music
listen
playlists
tank
fueli
transferring
refueling
mile
refuel
startfuel
gas
quotes
stockspanner
7212
73412
today
todays
span
msts
mst
pseudo-critical
24-hours
arrivaltime
delayedtime
potions
spells
potionsj
spellsi
potion
n-sided
triangulate
triangulation
addatindexint
doubly
indexth
mylinkedlist
deleteatindexint
addattailint
pointerreference
addatheadint
prev
square-free
lowlimit
highlimit
puzzlesi
baggage
beefed
abcdefg
cabbage
faced
incurs
homerow
colcosts
rowcostsr
homecol
homepos
colcostsc
rowcosts
prizepositionsi
prizepositions
prize
prizes
space-separated
entrancecol
maze
entrancerow
forts
fortsi
maxij
fort
minij
fortsk
base-k
contrary
base-10
base-2
k-mirror
2-mirror
075
pickindex
sumw
wlength
maxsum
popsmallest
addbackint
smallestinfiniteset
numspivot
k-similar
one-bit
sub-tree
re-use
desiredtotal
maxchoosableinteger
clipsi
sporting
clip
clips
lasted
multiples
dth
numselect
cnumselect
wordsjk
unusuable
suffixes
addpatch
patches
numsendi
numsstarti
134
competitive
case-insensitive
paragraph
verticalcuts
horizontalcuts
cake
verticalcutsj
horizontalcutsi
n-bit
gray
heightij
iswater
iswaterij
meanwhile
0100
processingtime
processid
machineid
unitssold
averageprice
purchasedate
enddate
startdate
corridor
decorative
dividers
divider
alike
non-adjacent
halve
secondlen
firstlen
unmarked
blacklist
blacklisted
policyholder
lon
tiv2016
longitude
latitude
policy
insurance
investment
policyholders
2015
tiv2015
holders
lat
2016
tribonacci
t0
tn1
tn3
tn
tn2
30000
time-points
ccjjc
abab
wonderful
separately
indexk
numsindexk
numsindex2
numsindex1
expressible
neccesarilly
personname
turnn
kilograms
turn1
holes
foobar
printbar
printfoo
cdefab
cdabef
abcdef
abefcd
efabcd
efcdab
acdbef
rulevalue
rulekey
namei
actordirector
actor
actorid
cooperated
director
directorid
index-0
uniques
262124
zbax
gridin
inverting
pillow
priority
redundant
havent
sunny
handling
wordstxt
one-line
pipes
unix
-numsi
well-spaced
watchedvideosi
watchedvideos
watched
general
friendsi
farthest
allocateint
allocatorint
freed
freeint
allocator
functionalities
slanted
pr
encodedtext
accessed
depict
transposition
originaltext
sells
tastiness
absnumsl
graphu
bipartite
graphv
fence
well-fenced
expensive
enclosed
pseudo-palindromic
reveal
movecostij
movecost
4x
0144567
4567014
6141
61741
6174
6741
daysi
rot
rotten
applesi
grows
widthjheightj
widthiheighti
interchangeable
width-to-height
scoreij
exams
ratingj
soldier
ratingk
toppings
topping
flavor
toppingcosts
basecosts
flavors
dessert
toppingcostsi
ice
basecostsi
cream
selects
averageamount
analyze
visitedon
spent
intime
1440
outtime
exits
eventday
cbad
ensures
parity
xored
secondi
minrootleftval
sub-node
sub-nodes
rootrightval
digit-logs
identifiers
letter-logs
identifier
space-delimited
snapid
array-like
snapshot
snapshotarrayint
setindex
snap
getindex
snapshotarray
seeding
destroy
accommodate
abcabc
84351
2314
346
maxdoubles
punishment
pk
primitive
outermost
decomposition
nonempty
endpos
accountsi
accountsi0
abcdefd
dcbaefd
fat
recyclable
lowfats
sneakily
remapping
mittal
remap
326
d2
congratulate
